It seems that for connecting two LPGs, you need to specify only one side the peer_id. It would be really helpful if you could include that in the documentation.

Also what I noticed is that after successful "terraform apply" the next terraform apply will force replace the LPG even if you have done state refresh ("terraform refresh") between the two applies. The second apply will go to error.

```
  # module...OCI_DB_network_LPG.oci_core_local_peering_gateway.local_peering_gateway["OCI-APP-network-LPG"] must be replaced
-/+ resource "oci_core_local_peering_gateway" "local_peering_gateway" {
        compartment_id               = "ocid1..."
      ~ defined_tags                 = {} -> (known after apply)
        display_name                 = "OCI-APP-network-LPG"
      ~ freeform_tags                = {} -> (known after apply)
      ~ id                           = "ocid1..." -> (known after apply)
      ~ is_cross_tenancy_peering     = false -> (known after apply)
      ~ peer_advertised_cidr         = "10.0.0.0/16" -> (known after apply)
      ~ peer_advertised_cidr_details = [
          - "10.0.0.0/16",
        ] -> (known after apply)
      ~ peer_id                      = "ocid1..." -> (known after apply) # forces replacement
      ~ peering_status               = "PEERED" -> (known after apply)
      ~ peering_status_details       = "Connected to a peer." -> (known after apply)
      + route_table_id               = (known after apply)
      ~ state                        = "AVAILABLE" -> (known after apply)
      ~ time_created                 = "2020-09-08 15:09:29.552 +0000 UTC" -> (known after apply)
        vcn_id                       = "ocid1..."
    }

module...module.OCI_DMZ_app_network.data.oci_core_subnets.cloud_network_data: Refreshing state...
module...module.OCI_database_network.data.oci_core_subnets.cloud_network_data: Refreshing state...
module...module.OCI_DB_network_LPG.oci_core_local_peering_gateway.local_peering_gateway["OCI-APP-network-LPG"]: Destroying... [id=ocid1...]
module...module.OCI_DMZ_app_network_LPG.data.oci_core_local_peering_gateways.local_gateways: Refreshing state...
module...module.OCI_DB_network_LPG.oci_core_local_peering_gateway.local_peering_gateway["OCI-APP-network-LPG"]: Destruction complete after 1s
module...module.OCI_DB_network_LPG.oci_core_local_peering_gateway.local_peering_gateway["OCI-APP-network-LPG"]: Creating...

Error: Service error:InvalidParameter. The Local Peering Gateway with ID ocid1... has already been connected.. http status code: 400. Opc request id: ...

```